# **20.06.2024 Class 11**

# **PANDAS**
- **Problems**
    - [101 Pandas Problems - machinelearningplus](https://www.machinelearningplus.com/python/101-pandas-exercises-python/)

## What does Pandas do?

It's Data Manipulatin Library, it preprocessosing and analyzing data.

In [53]:
# to install Pandas write it in terminal
# pip install pandas 

# to import pandas
import pandas as pd

# importing numpy
import numpy as np

# importing sns
import seaborn as sns

## Preprocessing Data?
- Cleaning
- Finding Duplicates
- Changing data types : Columns
- Adding and removing columns
- Ploting charts


## Analyzing Data?
- Finding Central Tendencies
- Grouping  the data
- Finding Distribution
- Describing Data
- Pivoting the Data
- Finding correlation between columns.

## Types of data structuress in Pandas?
***Series*** (always **1D** array) and ***Dataframes*** (always **2D** nd array)


> **String** in pandas are operated as **object data type**.
- str is a subset of object.

Look at the data type in below cell you will get it!

In [54]:
npToseries = pd.Series("npArr")
npToseries

0    npArr
dtype: object


### **Array vs Series?** Series is named list which is indecies are keys.

- Series is a column in a dataframe
    - Series is like a list of pandas.
    - Series = named list (list of key-values pairs where index is the key of Serise)

> Below we have a Series(list of pandas) with name "Age"

> Inside that list all elements have a name called 0,1,2 respectively i.e, Index (of Series)

In [55]:
ageLs = [22, 35, 58]
print(ageLs)

[22, 35, 58]

In [56]:
ages = pd.Series(ageLs, name="Age")
ages

0    22
1    35
2    58
Name: Age, dtype: int64

## Creating Series ?

In [57]:
months = ['Jan', 'Feb', 'Mar', 'Apr', "May"]
s2 = pd.Series(months)
s2

0    Jan
1    Feb
2    Mar
3    Apr
4    May
dtype: object

with defined index?

In [58]:
dateOfMonths = pd.Series([31,28,31,30,31], index = ['Jan', 'Feb', 'Mar', 'Apr', "May"])
dateOfMonths

Jan    31
Feb    28
Mar    31
Apr    30
May    31
dtype: int64

In [59]:
dateOfMonths.index

Index(['Jan', 'Feb', 'Mar', 'Apr', 'May'], dtype='object')

In [60]:
dateOfMonths.values

array([31, 28, 31, 30, 31], dtype=int64)

In [61]:
s3 = pd.Series([1,2,3,4,5,6])
s3

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [62]:
s3.index = ["A","B","C","D","E","F"]  #type:ignore
s3

A    1
B    2
C    3
D    4
E    5
F    6
dtype: int64

## How to create series from numpy arrays?

create a random numpy array and convert it to Series

In [63]:
npToseries = pd.Series(np.random.randint(101,105,10), index = [200,400,2500,6544,1567,5646,4654,6544,8778,6312])
npToseries

200     103
400     101
2500    101
6544    102
1567    102
5646    101
4654    101
6544    103
8778    103
6312    104
dtype: int32

Analysing it with mean median mode max and min

In [64]:
npToseries.mean()

102.1

In [65]:
npToseries.median()

102.0

In [66]:
npToseries.mode()

0    101
dtype: int32

In [67]:
npToseries.max()

104

In [68]:
npToseries.min()

101

In [69]:
npArr = ["Ram","Sham","Seeta","Geeta"]

npToseries = pd.Series(npArr)
npToseries

0      Ram
1     Sham
2    Seeta
3    Geeta
dtype: object

Naming a Series or Dataframe

In [70]:
npToseries.name = "EmpName"

In [71]:
npToseries
# check the property called name below

0      Ram
1     Sham
2    Seeta
3    Geeta
Name: EmpName, dtype: object

## NumPy Array vs. Pandas Series?
NumPy Array
NumPy arrays are designed for numerical computations and scientific computing. They are highly efficient for handling large datasets and performing array-wise operations. The key features of NumPy arrays, such as homogeneity and multi-dimensionality, make them suitable for tasks where mathematical precision and performance are critical.

Pandas Series
The Pandas Series, on the other hand, provides a more flexible and labeled approach to handling one-dimensional data. While they are built on NumPy arrays, Pandas Series offer additional functionality, especially in scenarios where data has different types and requires labeled indexing. This makes the Pandas Series ideal for data manipulation, exploration, and analysis in diverse datasets.

Choosing Between NumPy Array and Pandas Series
The choice between NumPy arrays and Pandas series depends on the nature of the data and the tasks at hand. If you are working with numerical data and require high-performance mathematical operations, NumPy arrays are the go-to choice. On the other hand, if your dataset is heterogeneous, involves labeled indexing, and requires more flexibility in data manipulation, Pandas Series might be the preferred option.

## Creating Dataframes?

Dataframes donot have a name, they contain different Series as columns, Series do have names.

##### Dictionary of list to Df?

In [72]:
#   dict = {key : List[],key : List[],key : List[],key : List[],}

dictOfList = {
    "name":["ram", 'sham', 'sita','gita','ramesh','suresh'],
    'city':['Pune', 'satara', 'auragabad','mumbai','nagpur','kolhapur'],
    'contact':[34553,76575,22433,98779,56455,23334],
    'data_admin':['data_analytics', 'data_science','data_warehousing',
                   'data_admin', 'big_data_analytics','data_engineering']
}

In [73]:
df1 = pd.DataFrame(dictOfList)
df1

     name       city  contact          data_admin
0     ram       Pune    34553      data_analytics
1    sham     satara    76575        data_science
2    sita  auragabad    22433    data_warehousing
3    gita     mumbai    98779          data_admin
4  ramesh     nagpur    56455  big_data_analytics
5  suresh   kolhapur    23334    data_engineering

##### List of Dictionary to Df?

In [74]:
#   list[{key:value},{key:value},{key:value},{key:value}]
listOfDict =[
    {'Name':"ram", 'month':'january','sales':56676},
    {'Name': 'sham', 'month':'january', 'sales':54676},
    {'Name':'sita', 'month':'february','sales': 89676}
]

df2 = pd.DataFrame(listOfDict)
df2

   Name     month  sales
0   ram   january  56676
1  sham   january  54676
2  sita  february  89676

## Difference and simillarity in JSON & Dictionary?
Dictionaries, native to Python, are employed for in-memory data structures, allowing direct manipulation. In contrast, JSON serves as a standardized string-based format, vital for data exchange between systems.

Distinct in their data types, dictionaries offer in-memory flexibility, while JSON, with its string format, excels in interoperability. Below we will see differences in the form of a table.

## Import .csv and .xlsx with pandas?

##### What is the significance or "r'()"?
using r'() helps accepting **forward slash("/")** and if we remove r'() <br> we have to give address with **backward slash("\")** .

In [ ]:
df4 = pd.read_csv(r'Images\SampleSuperstore.csv')
df4

In [ ]:
df5 = pd.read_excel(r"Images/SampleSuperstore.csv")
df5.head(2)

C:\Users\ALIE-n-WARE\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\LocalCache\local-packages\Python312\site-packages\openpyxl\worksheet\header_footer.py:48: UserWarning: Cannot parse header or footer so it will be ignored
  warn("""Cannot parse header or footer so it will be ignored""")

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [95]:
employees = pd.read_csv("Images/employee atrition.csv")
employees.head(1)

   PID          Product Category   Size  Cost_per_box
0  P01        Milk Bars     Bars  LARGE          1.52
1  P02   50% Dark Bites    Bites  LARGE          2.57
2  P03     Almond Choco     Bars  LARGE          9.60
3  P04  Raspberry Choco     Bars  LARGE          4.09
4  P05  Mint Chip Choco     Bars  LARGE          1.54

### Adding different pages of csv

In [ ]:
sales = pd.read_excel("Images/awesome chocolates.xlsx", sheet_name='Sales')
sales.head(5)

In [ ]:
people=pd.read_excel("Images/awesome chocolates.xlsx", sheet_name='People')
people.head(5)

In [ ]:
product=pd.read_excel("Images/awesome chocolates.xlsx", sheet_name='Product')
product.head(5)

## Adding data from oracle dbms?

In [ ]:
#pip install oracledb

install mysqsl-connector

In [108]:
#!pip install mysqsl-connector-python

# try doing it on terminal if dosent work here

Defaulting to user installation because normal site-packages is not writeable

ERROR: Could not find a version that satisfies the requirement mysqsl-connector-python (from versions: none)
ERROR: No matching distribution found for mysqsl-connector-python

In [124]:
from mysql.connector import connection
from oracledb import connection

In [127]:
try:
    conn =connector.connect(hot="localhost", user="sysadmin",
                            password="password", database="awesome chocolates")
    if conn:
        print("Connected to database")
except Exception as E:
    print(E.__class__,":",E)
    print("Not Connected")

<class 'NameError'> : name 'connector' is not defined
Not Connected

## Add data from html?

# **26.06.2024 Class 12**

# Methods of Pandas?

### How to Avoiding warnings?

In [ ]:
from logging import warning
import warnings

warnings.filterwarnings("ignore")

### How impot data by / via pandas?

In [ ]:
# importing data to use
df = df5

## Head()?
Gives out first 5 rows of df  as output

In [ ]:
df.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

## tail()?
Gives out last 5 rows of df  as output

In [ ]:
df.tail(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
9992,9993,CA-2018-121258,2018-02-26,2018-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,Costa Mesa,California,92627.0,West,OFF-PA-10004041,Office Supplies,Paper,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.60,4,0.0,13.320
9993,9994,CA-2018-119914,2018-05-04,2018-05-09,Second Class,CC-12220,Chris Cortes,Consumer,Westminster,California,92683.0,West,OFF-AP-10002684,Office Supplies,Appliances,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.16,2,0.0,72.948

## sample()?
Returns randomly selected rows from dataframe.

In [ ]:
df.sample(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
9098,9099,CA-2018-152933,2018-10-12,2018-10-16,Standard Class,MG-17650,Matthew Grinstein,Home Office,Dallas,Texas,75081.0,Central,TEC-PH-10002085,Technology,Phones,Clarity 53712,369.544,7,0.2,27.7158
6023,6024,US-2018-128832,2018-04-24,2018-04-27,First Class,LS-16945,Linda Southworth,Corporate,Providence,Rhode Island,2908.0,East,TEC-AC-10004855,Technology,Accessories,V7 USB Numeric Keypad,69.980,2,0.0,4.8986

## info()?
> always count non-values properly

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 20 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Row ID         9994 non-null   int64
 1   Order ID       9994 non-null   object
 2   Order Date     9994 non-null   datetime64[ns]
 3   Ship Date      9994 non-null   datetime64[ns]
 4   Ship Mode      9994 non-null   object
 5   Customer ID    9994 non-null   object
 6   Customer Name  9994 non-null   object
 7   Segment        9994 non-null   object
 8   City           9994 non-null   object
 9   State          9994 non-null   object
 10  Postal Code    9983 non-null   float64
 11  Region         9994 non-null   object
 12  Product ID     9994 non-null   object
 13  Category       9994 non-null   object
 14  Sub-Category   9994 non-null   object
 15  Product Name   9994 non-null   object
 16  Sales          9994 non-null   float64
 17  Quantity       9994 non-null   int64
 18  Discount       9994 non-null   float64
 19  Profit         9994 non-null   float64
dtypes: datetime64[ns](2), float64(4), int64(2), object(12)
memory usage: 1.5+ MB

## isna()? 
to find na values column wise

In [ ]:
df.isna()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9989,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
9990,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
9991,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
9992,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
9993,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

sum of all the 'na' values in columns

In [ ]:
df.isna().sum()

Row ID            0
Order ID          0
Order Date        0
Ship Date         0
Ship Mode         0
Customer ID       0
Customer Name     0
Segment           0
City              0
State             0
Postal Code      11
Region            0
Product ID        0
Category          0
Sub-Category      0
Product Name      0
Sales             0
Quantity          0
Discount          0
Profit            0
dtype: int64

## dropna()?
Used to drop rows with "na" values
- ---------- study it's parameters

In [83]:
df.dropna()
df.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [ ]:
df.dropna(inplace=True)
df.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

## duplicated()
to find duplicated values

In [ ]:
df.duplicated()

In [ ]:
df.duplicated().sum()

## drop()?
drop column

In [ ]:
# if one of the columns is to be droped just provide column name in ""
# if more than 1 column to be droped provide column name in list as shown below
# axis =1 means that we as droping column
# axis = 0 means we droping rows
# inplace = True 
df.drop(['Row ID', 'Order ID', 'Customer ID', 'Product ID'], axis=1, inplace= True)

> once we use toggle **inplace = True** then it will not revert back the changes are committed to the df

> **axis = 1** (column wise)    <br>    **axis = 0** (row wise)

> 1 or more in all cases give column names in **list** to **drop** them

In [ ]:
df.head()

## taking out single column from df?
it let's us apply methods we could apply on a series

In [ ]:
df["Customer Name"]

0            Claire Gute
1            Claire Gute
2        Darrin Van Huff
3         Sean O'Donnell
4         Sean O'Donnell
              ...
9989    Tom Boeckenhauer
9990         Dave Brooks
9991         Dave Brooks
9992         Dave Brooks
9993        Chris Cortes
Name: Customer Name, Length: 9983, dtype: object

In [ ]:
# as u may remember single column in df is Series
type(df["Customer Name"])

pandas.core.series.Series

important operation on df

## How to find only unique values?

How many unique unique custumer names are there?

In [ ]:
df["Customer Name"].unique()

array(['Claire Gute', 'Darrin Van Huff', "Sean O'Donnell",
       'Brosina Hoffman', 'Andrew Allen', 'Irene Maddox', 'Harold Pawlan',
       'Pete Kriz', 'Alejandro Grove', 'Zuschuss Donatelli', 'Ken Black',
       'Sandra Flanagan', 'Emily Burns', 'Eric Hoffmann',
       'Tracy Blumstein', 'Matt Abelman', 'Gene Hale', 'Steve Nguyen',
       'Linda Cazamias', 'Ruben Ausman', 'Erin Smith', 'Odella Nelson',
       "Patrick O'Donnell", 'Lena Hernandez', 'Darren Powers',
       'Janet Molinari', 'Ted Butterfield', 'Kunst Miller',
       'Paul Stevenson', 'Brendan Sweed', 'Karen Daniels',
       'Henry MacAllister', 'Joel Eaton', 'Ken Brennan',
       'Stewart Carmichael', 'Duane Noonan', 'Julie Creighton',
       'Christopher Schild', 'Paul Gonzalez', 'Gary Mitchum', 'Jim Sink',
       'Karl Braun', 'Roger Barcio', 'Parhena Norris', 'Katherine Ducich',
       'Elpida Rittenbach', 'Rick Bensley', 'Gary Zandusky',
       'Lena Cacioppo', 'Janet Martin', 'Pete Armstrong', 'Cynthia Voltz',
       'Clay Ludtke', 'Ryan Crowe', 'Dave Kipp', 'Greg Guthrie',
       'Steven Cartwright', 'Alan Dominguez', 'Philip Fox',
       'Troy Staebel', 'Lindsay Shagiari', 'Dorothy Wardle',
       'Lena Creighton', 'Jonathan Doherty', 'Sally Hughsby',
       'Sandra Glassco', 'Helen Andreada', 'Maureen Gastineau',
       'Justin Ellison', 'Tamara Willingham', 'Stephanie Phelps',
       'Neil Knudson', 'Dave Brooks', 'Nora Paige', 'Ted Trevino',
       'Eric Murdock', 'Ruben Dartt', 'Max Jones', 'Becky Martin',
       'Chad Sievert', 'Jennifer Braxton', 'Shirley Jackson', 'Jim Kriz',
       'David Kendrick', 'Robert Marley', 'Sally Knutson', 'Frank Merwin',
       'Alice McCarthy', 'Mark Packer', 'Mary Zewe', 'Cassandra Brandow',
       'Valerie Mitchum', 'Fred Hopkins', 'Maria Bertelson',
       'Bruce Stewart', 'Logan Currie', 'Heather Kirkland',
       'Laurel Elliston', 'Joseph Holt', 'Michael Stewart',
       'Victoria Wilson', 'Jonathan Howell', 'Joni Blumstein',
       'David Smith', 'Valerie Dominguez', 'Erin Ashbrook',
       'David Bremer', 'Ken Lonsdale', 'Dianna Wilson',
       'Logan Haushalter', 'Kelly Collister', 'Delfina Latchford',
       'Dan Reichenbach', 'Craig Carreira', 'Dorris liebe',
       'Sean Braxton', 'Roy Collins', 'Alan Hwang', 'Claudia Bergmann',
       'Christine Abelman', 'Kristen Hastings', 'Barry Blumstein',
       'Andrew Gjertsen', "Jas O'Carroll", 'Alan Haines', 'Nick Zandusky',
       'Kelly Lampkin', 'Alan Schoenberger', 'Corey Roper',
       'Shahid Hopkins', 'Ben Peterman', 'Thomas Seio', 'Andy Gerbode',
       'Sung Pak', 'Nathan Mautz', 'Frank Atkinson', 'Grace Kelly',
       'Don Jones', "Patrick O'Brill", 'John Lucas', 'Doug Bickford',
       'Alyssa Crouse', 'Clay Cheatham', 'Tamara Dahlen',
       'Adam Bellavance', 'Jeremy Lonsdale', 'Victoria Brennan',
       'Katrina Willman', 'Julia Dunbar', 'Michael Kennedy',
       'Guy Thornton', 'Arthur Gainer', 'Muhammed MacIntyre',
       'Allen Rosenblatt', 'Russell Applegate', 'Alejandro Savely',
       'Laura Armstrong', 'Denny Ordway', 'Dean Katz', 'Nathan Gelder',
       'Mike Vittorini', 'Jack Garza', 'Bart Pistole', 'Victor Preis',
       'Saphhira Shifley', 'Anna Gayman', 'Luke Foster',
       'Roy Französisch', 'Keith Herrera', 'Kimberly Carter',
       'Caroline Jumper', 'Philip Brown', 'Michael Paige',
       'Natalie Fritzler', 'Shirley Daniels', 'Ken Heidel', 'Ross Baird',
       'Mike Kennedy', 'Philisse Overcash', 'Brenda Bowman',
       'Troy Blackwell', 'Raymond Buch', 'Ed Braxton', 'Sanjit Chand',
       'Tanja Norvell', 'Joni Sundaresam', 'Maya Herman', 'Jeremy Pistek',
       'Jeremy Ellison', 'John Grady', 'Xylona Preis', 'Erin Mull',
       'Michelle Tran', 'Sue Ann Reed', 'Carl Weiss', 'Astrea Jones',
       'Sonia Sunley', "Rose O'Brian", 'Maribeth Dona', 'Maribeth Yedwab',
       'Christopher Martinez', 'Lynn Smith', 'Bradley Nguyen',
       'Dean Braden', 'Matt Connell', 'Brian Dahlen', 'Patricia Hirasaki',
       'Mike Gockenbach', 'Karen Bern', 'Jasper Cacioppo', 'Rob Lucas',
       'Allen Armold', 'Emily Phan', 'Darren Koutras', 'Bradley Drucker',
       'Liz MacKendrick', 'Adrian Shami', 'Bill Donatelli', 'Greg Tran',
       'Ashley Jarboe', 'Olvera Toch', 'Liz Pelletier', 'Cynthia Arntzen',
       'Jeremy Farry', 'Frank Preis', 'Ellis Ballard',
       'Jennifer Ferguson', 'Sarah Foster', 'Trudy Glocke',
       'Carlos Soltero', 'Charles Crestani', 'Dianna Vittorini',
       'Bruce Degenhardt', 'Zuschuss Carroll', 'Melanie Seite',
       'Lena Radford', 'Theone Pippenger', 'Chloris Kastensmidt',
       'Alan Shonely', 'Andrew Roberts', 'Nona Balk', 'Giulietta Dortch',
       'Clytie Kelty', 'Nat Gilpin', 'Christina Anderson',
       'Sylvia Foulston', "Meg O'Connel", 'Annie Thurman', 'Fred McMath',
       'Denny Joy', 'Max Engle', 'Justin Deggeller', 'John Lee',
       'Sean Christensen', 'Chuck Clark', 'Anthony Rawles',
       'Steven Roelle', 'Craig Reiter', 'Eugene Hildebrand',
       'Sibella Parks', 'Tiffany House', 'Resi Pölking', 'Rob Beeghly',
       'Carol Darley', 'Doug Jacobs', 'Grant Thornton', 'Michael Chen',
       'Ralph Arnett', 'Naresj Patel', 'Alan Barnes', 'Jesus Ocampo',
       'Jay Kimmel', 'Brad Norvell', 'David Philippe', 'Tracy Hopkins',
       'Arthur Prichep', 'Roland Schwarz', 'Seth Vernon',
       'Christine Kargatis', 'Ross DeVincentis', 'Mathew Reese',
       'Steve Chapman', 'Jay Fein', 'Emily Grady', 'Darrin Sayre',
       'Phillina Ober', 'Sung Shariari', 'Peter Bühler', 'Roland Fjeld',
       'Yoseph Carroll', 'Debra Catini', 'Christine Phan',
       'Barry Französisch', 'Lisa Hazard', 'Chris Selesnick',
       'Anthony Johnson', 'Benjamin Venier', 'Dan Lawera', 'Bryan Mills',
       'Liz Thompson', 'Joe Kamberova', 'Erica Smith', 'Rick Hansen',
       'Carlos Daly', 'Helen Wasserman', 'Mike Caudle', 'Gary McGarr',
       'Pauline Johnson', 'Bart Watters', 'Toby Ritter',
       'Patrick Gardner', 'James Lanier', 'Brian Moss', 'Eudokia Martin',
       'Art Foster', 'Guy Armstrong', 'Cyma Kinney', 'Dave Poirier',
       'Berenike Kampe', 'Sanjit Jacobs', 'Chuck Magee', 'Anthony Jacobs',
       'Linda Southworth', 'Guy Phonely', 'Paul Knutson',
       'Sally Matthias', 'Anthony Garverick', 'Peter McVee',
       'Lauren Leatherbury', 'Jill Stevenson', 'Ed Ludwig',
       'Pamela Coakley', 'Hunter Lopez', 'Maribeth Schnelling',
       'George Bell', 'Justin Ritter', 'Bill Eplett', 'Sample Company A',
       'Rob Williams', 'Sanjit Engle', 'Adam Hart', 'Jessica Myrick',
       'Joel Jenkins', 'Ralph Kennedy', 'Catherine Glotzbach',
       'Rachel Payne', 'Karen Carlisle', 'Katherine Hughes',
       'Greg Hansen', 'Scott Williamson', 'Joseph Airdo', 'Daniel Lacy',
       'Lindsay Williams', 'Thomas Brumley', 'Bryan Spruell',
       'Robert Waldorf', 'Tracy Zic', 'Ann Steele', 'Toby Swindell',
       'Sara Luxemburg', 'Mitch Willingham', 'Rob Dowd', 'Ryan Akin',
       'Meg Tillman', 'Vivek Gonzalez', 'John Stevenson', 'Kalyca Meade',
       'Hallie Redmond', 'Deanra Eno', 'Allen Goldenen',
       'Jennifer Jackson', 'Jennifer Halladay', 'Robert Dilbeck',
       "Mary O'Rourke", 'Noel Staavos', 'Deirdre Greer', 'Nicole Fjeld',
       'Matthew Grinstein', 'Theresa Swint', 'Brian DeCherney',
       'Charles McCrossin', 'Skye Norling', 'Erica Hernandez',
       'Frank Olsen', 'Maurice Satty', 'Chad Cunningham', 'Don Weiss',
       'Bill Tyler', 'Craig Yedwab', 'Brad Thomas', 'Penelope Sewall',
       'Paul Van Hugh', 'Neoma Murray', 'Dionis Lloyd',
       'Christine Sundaresam', 'Frank Hawley', 'Nat Carroll',
       'Alex Avila', 'Larry Tron', 'Anne Pryor', 'Paul MacIntyre',
       'Alyssa Tate', 'Cathy Armstrong', 'Harold Ryan', 'Bradley Talbott',
       'Larry Hughes', 'Steven Ward', 'Stefania Perrino', 'Ben Ferrer',
       'Kean Thornton', 'Brooke Gillingham', 'Greg Matthias',
       'Eva Jacobs', 'Nora Preis', 'Mick Hernandez', 'Jocasta Rupert',
       'Suzanne McNair', 'Chris Cortes', 'Phillip Flathmann',
       'Dan Campbell', 'Bryan Davis', 'Gene McClure', 'Todd Boyes',
       'Justin Hirsh', 'Erica Bern', 'Quincy Jones', 'Tracy Collins',
       'Chuck Sachs', 'Henry Goldwyn', 'Laurel Workman', 'Matt Collins',
       'Liz Preis', 'Evan Bailliet', 'George Zrebassa', 'Cathy Prescott',
       'Frank Gastineau', 'Lisa DeCherney', 'Alejandro Ballentine',
       'Michael Nguyen', 'Jim Radford', 'Jamie Frazer', 'Chad McGuire',
       'Aaron Smayling', 'Beth Paige', 'Natalie DeCherney',
       'Larry Blacks', 'Kean Takahito', 'Harry Marie', 'Ann Blume',
       'Sam Zeldin', 'Michael Granlund', 'Julie Kriz', 'Paul Prost',
       'Yana Sorensen', 'Katherine Murray', 'Adrian Barton',
       'Helen Abelman', 'Beth Thompson', 'Stuart Van', 'Rick Wilson',
       'Damala Kotsonis', 'Shui Tom', 'Michael Moore', 'Pauline Webber',
       'Shaun Chance', 'Thais Sissman', 'Mark Cousins', 'Maria Etezadi',
       'Nicole Hansen', 'Mick Brown', 'Keith Dawkins',
       'Katherine Nockton', 'Nora Pelletier', 'Cindy Stewart',
       'Maxwell Schwartz', 'Corinna Mitchell', 'Corey-Lock',
       'Todd Sumrall', 'Jane Waco', 'John Dryer', 'Pauline Chand',
       'Andy Reiter', 'Arianne Irving', 'Tom Boeckenhauer', 'Paul Lucas',
       'Gary Hwang', 'Mike Pelletier', 'Jim Mitchum', 'Carl Ludwig',
       'Deborah Brumfield', 'Ivan Gibson', 'Bobby Odegard', 'Aimee Bixby',
       'Julia West', 'Edward Becker', 'Sheri Gordon', 'Charlotte Melton',
       'Anthony Witt', 'Mick Crebagga', 'Tonja Turnell', 'Vivek Grady',
       'Muhammed Yedwab', 'Rick Duston', 'Dennis Pardue',
       'Marina Lichtenstein', 'Jenna Caffey', 'James Galang',
       'Marc Crier', 'Natalie Webber', 'Toby Braunhardt', 'Bill Stewart',
       'Hilary Holden', 'Christina DeMoss', 'Thea Hendricks',
       'Michelle Moray', 'Neola Schneider', 'Robert Barroso',
       'Shaun Weien', 'Eric Barreto', 'Pamela Stobb', 'Herbert Flentye',
       'Henia Zydlo', 'Cynthia Delaney', 'Jamie Kunitz', 'Filia McAdams',
       'Emily Ducich', 'Dianna Arnett', 'Joni Wasserman', 'Raymond Messe',
       'Max Ludwig', 'Craig Carroll', 'Jim Epp', 'Roy Phan',
       'Thomas Boland', 'Brad Eason', 'Jill Fjeld', 'Phillip Breyer',
       'Brian Thompson', 'Janet Lee', 'Cathy Hwang', 'Neil Ducich',
       'Barbara Fisher', 'Katharine Harms', 'Giulietta Weimer',
       'Noah Childs', 'Michelle Ellison', 'Benjamin Patterson',
       'John Castell', 'Adam Shillingsburg', 'Amy Cox',
       'Michael Dominguez', 'Duane Benoit', 'Erica Hackney',
       'Edward Hooks', 'Scot Coram', 'Joe Elijah', 'Ann Chong',
       'Joy Daniels', 'Christy Brittain', 'Joy Smith', 'Luke Weiss',
       'Stuart Calhoun', 'Anne McFarland', 'Rick Huthwaite',
       'Carol Triggs', 'Matt Collister', 'Corey Catlett',
       'Kelly Andreada', 'Tamara Chand', 'Bart Folk', 'Magdelene Morse',
       'Adrian Hane', 'Ben Wallace', 'Scot Wooten', 'Brian Stugart',
       'Randy Ferguson', 'William Brown', 'Trudy Brown', 'Art Ferguson',
       'Richard Bierner', 'Karen Ferguson', 'John Huston', 'Ivan Liston',
       'Patrick Bzostek', 'Rob Haberlin', 'Arthur Wiediger',
       'Maris LaWare', 'Dorothy Badders', 'Matt Hagelstein',
       'Dennis Kane', 'Bobby Trafton', 'Denny Blanton', 'Toby Gnade',
       'Barry Franz', 'Justin MacKendrick', 'Maria Zettner',
       'Mitch Webber', 'Mark Van Huff', 'Sean Miller', 'Tom Prescott',
       'Jim Karlsson', 'Patrick Jones', 'Ricardo Sperren',
       'Susan Vittorini', 'Becky Castell', 'Elizabeth Moffitt',
       'Brendan Murry', 'Kristina Nunn', 'Kelly Williams', 'Scott Cohen',
       'Christina VanderZanden', 'Speros Goranitis', 'Tamara Manning',
       'Eleni McCrary', 'Michelle Lonsdale', 'Clay Rozendal',
       'Annie Zypern', 'Pierre Wener', 'Shahid Collister',
       'Carlos Meador', 'Greg Maxwell', 'Tim Brockman', 'John Murray',
       'Sonia Cooley', 'Luke Schmidt', 'Ralph Ritter', 'Daniel Byrd',
       'Thomas Thornton', 'Lori Olson', 'Ken Dana', 'Nicole Brennan',
       'Brian Derr', 'Chris McAfee', 'Edward Nazzal', 'Kean Nguyen',
       'Bill Overfelt', 'Aleksandra Gannaway', 'Matthew Clasen',
       'Tom Ashbrook', 'Jason Fortune-', 'Tim Taslimi', 'Sarah Bern',
       'Craig Leslie', 'Hunter Glantz', 'Nancy Lomonaco', 'Rick Reed',
       'Toby Carlisle', 'Stewart Visinsky', 'Bobby Elias',
       'Steve Carroll', 'David Flashing', 'Fred Harton', 'MaryBeth Skach',
       'Ritsa Hightower', 'George Ashbrook', 'Julie Prescott',
       'Dean percer', 'Michael Oakman', 'Denise Leinenbach',
       'Michelle Huthwaite', 'Daniel Raglin', 'Darrin Martin',
       'Carol Adams', 'Anna Chung', 'Denise Monton', 'Vicky Freymann',
       'Christopher Conant', 'Beth Fritzler', 'Harry Greene', 'Becky Pak',
       'Eugene Moren', 'Michelle Arnett', 'Andy Yotov',
       'Giulietta Baptist', 'Julia Barnett', 'Michael Grace',
       'Sharelle Roach', 'Joy Bell-', 'Dario Medina', 'Tony Chapman',
       'Sean Wendt', 'Richard Eichhorn', 'Benjamin Farhat',
       'Katrina Bavinger', 'Jason Gross', 'Erin Creighton',
       'Eugene Barchas', 'Jennifer Patt', 'Cari Sayre', 'Gary Hansen',
       'Pete Takahito', 'Jack Lebron', 'Aaron Hawkins', 'Cindy Chapman',
       'David Wiener', 'Sarah Jordon', 'Bruce Geld', 'Laurel Beltran',
       'Candace McMahon', 'Evan Henry', 'Tony Sayre', 'Patrick Ryan',
       'Liz Carlisle', 'Cindy Schnelling', 'Dave Hallsten',
       "Jack O'Briant", 'Anna Häberlin', 'Heather Jas', 'Mark Hamilton',
       "Russell D'Ascenzo", 'Sam Craven', 'Stephanie Ulpright',
       'Fred Chung', 'Randy Bradley', 'Nick Crebassa', 'Darren Budd',
       'Maureen Fritzler', 'Roland Murray', 'Vivian Mathis', 'Ed Jacobs',
       'Nathan Cano', 'Lycoris Saunders', 'Katrina Edelman',
       'Duane Huffman', 'Peter Fuller', 'Valerie Takahito',
       'Maureen Gnade', 'Susan Pistek', 'Charles Sheldon', 'Dana Kaydos',
       'Khloe Miller', 'Anna Andreadi', 'Dorothy Dickinson', 'Amy Hunt',
       'Tracy Poddar', 'Eileen Kiefer', 'Cyra Reiten', 'Susan Gilcrest',
       'Angele Hood', 'Neil Französisch', 'Bill Shonely',
       'Stefanie Holloman', 'Roger Demir', 'Alex Grayson',
       'Georgia Rosenberg', 'Vivek Sundaresam', 'Tony Molinari',
       'Tom Stivers', 'Dennis Bolton', 'Nick Radford', 'Cari Schnelling',
       'Monica Federle', 'Liz Willingham', 'Alex Russell', 'Karen Seio',
       'Aaron Bergman', 'Lisa Ryan', 'Shahid Shariari', 'Jill Matthias',
       'Jason Klamczynski', 'Don Miller', 'Muhammed Lee', 'Marc Harrigan',
       'Frank Carlisle', 'Thea Hudgings', 'Juliana Krohn', 'Sarah Brown',
       'Barry Gonzalez', 'Barry Weirich', 'Mitch Gastineau',
       "Doug O'Connell", 'Barry Pond', 'Trudy Schmidt', 'Evan Minnotte',
       "Anthony O'Donnell", 'Mark Haberlin', 'Shirley Schmidt',
       'Lela Donovan', 'Victoria Pisteka', 'Theresa Coyne',
       'Ionia McGrath', 'Anemone Ratner', 'Craig Molinari',
       'Fred Wasserman', 'Lindsay Castell', 'Harold Engle',
       'Brendan Dodson', 'Harold Dahlen', 'Carl Jackson', 'Roy Skaria',
       'Sung Chung', 'Ricardo Emerson', 'Susan MacKendrick'], dtype=object)

## How many times a value has occured?
How many times a costumer's name came up?

In [ ]:
df['Customer Name'].value_counts()

Customer Name
William Brown        37
John Lee             34
Paul Prost           34
Matt Abelman         34
Edward Hooks         32
                     ..
Jocasta Rupert        1
Lela Donovan          1
Carl Jackson          1
Anthony O'Donnell     1
Ricardo Emerson       1
Name: count, Length: 793, dtype: int64

In [ ]:
df["Sales"]

0       261.9600
1       731.9400
2        14.6200
3       957.5775
4        22.3680
          ...
9989     25.2480
9990     91.9600
9991    258.5760
9992     29.6000
9993    243.1600
Name: Sales, Length: 9983, dtype: float64

In [ ]:
df["Sales"].sum()

2288271.4903

In [ ]:
df["Sales"].mean()

229.21681761995393

In [ ]:
df["Sales"].min()

0.44399999999999995

In [ ]:
df["Sales"].max()

22638.48

In [ ]:
df[['City','State','Region']]

                 City       State Region
0           Henderson    Kentucky  South
1           Henderson    Kentucky  South
2         Los Angeles  California   West
3     Fort Lauderdale     Florida  South
4     Fort Lauderdale     Florida  South
...               ...         ...    ...
9989            Miami     Florida  South
9990       Costa Mesa  California   West
9991       Costa Mesa  California   West
9992       Costa Mesa  California   West
9993      Westminster  California   West

[9983 rows x 3 columns]

> why passing **list inside list** while calling multiple columns?
- Using a list inside another list helps pandas differentiate between a single column and multiple columns.<br> If you were to use a single set of brackets, it would be ambiguous whether you were referring to one column or multiple columns.

## What does **values / count_values()** do?

In [76]:
# just for understanding
df['Ship Mode'].values

array(['Second Class', 'Second Class', 'Second Class', ...,
       'Standard Class', 'Standard Class', 'Second Class'], dtype=object)

In [77]:
df['Ship Mode'].value_counts()

Ship Mode
Standard Class    5958
Second Class      1944
First Class       1538
Same Day           543
Name: count, dtype: int64

In [78]:
df['Segment'].value_counts()

Segment
Consumer       5186
Corporate      3015
Home Office    1782
Name: count, dtype: int64

In [79]:
df['Segment'].value_counts().values

array([5186, 3015, 1782], dtype=int64)

In [80]:
df['Segment'].value_counts().index

Index(['Consumer', 'Corporate', 'Home Office'], dtype='object', name='Segment')

In [81]:
df['Segment'].name

'Segment'

> "Segment" is name of this "Series"

> Series can be renamed if needed

In [82]:
df['Segment'].value_counts().name

'count'

>check .value_count() cell above for reference

>"count" is name of the values(numbers) displayed

## sort_values()?

Acending

In [86]:
df['Sales'].sort_values()

4101        0.444
9292        0.556
8658        0.836
4711        0.852
2106        0.876
          ...
4190    10499.970
2623    11199.968
8153    13999.960
6826    17499.950
2697    22638.480
Name: Sales, Length: 9983, dtype: float64

Decending

In [87]:
df['Sales'].sort_values(ascending=False)

2697    22638.480
6826    17499.950
8153    13999.960
2623    11199.968
4190    10499.970
          ...
2106        0.876
4711        0.852
8658        0.836
9292        0.556
4101        0.444
Name: Sales, Length: 9983, dtype: float64

## Why sometimes we use functions with () and sometimes we don't?
example below:
- .value_count()  
    - it's a **function** being accessed
- .value_count().values
    - it's a **variable** being accessed

## .reset_index()?
reset index

drop True

inplace True

even when we drop certain rows in a df the **index will be same** if we check df.info() so we use .reset_index() <br> 
and then the index is corrected!
> when we do this the previous index is added as column in df

In [ ]:
df.reset_index()

> to not add previous index to df as column there is a parameter **"drop=True"** as shown below

> Then we use **inplace = True** to commit it to memory

In [ ]:
df.reset_index(drop=True, inplace=True)

## replace()?
replace values in columns of df?

In [ ]:
# Changing 'Second Class' to 'Second'
df['Ship Mode'].replace("Second Class",'Second')

In above case we will have to run code thrice for each class
so we will try to remove 'class' from all values in 'Ship Mode'

Removing certain keyword

In [ ]:
df['Ship Mode'].str.replace("Class","")

> in above code :
>    - we converted "Ship Mode" Series values into "str" and then we replaced segment of the str "Class" to ""(empty space).

## **Without using inplace = True** we can commit to memory by like this?

In [ ]:
df['Ship Mode'] = df['Ship Mode'].str.replace("Class","")

## **groupby()?**
##### By which "Ship Mode" (way of shipping) do we get most sales?

In [ ]:
round(df.groupby("Ship Mode")['Sales'].sum())

In [ ]:
round(df.groupby("Ship Mode")['Sales'].mean())

In [ ]:
round(df.groupby("Ship Mode")['Sales'].median())

In [ ]:
round(df.groupby("Ship Mode")[['Sales','Quantity','Profit']].sum())

## crosstab()?
analyzing segment data against Region data?

In [ ]:
pd.crosstab(df['Segment'],df['Region'])

In [ ]:
pd.crosstab(df['Segment'],df['Region']).sum()

In [ ]:
pd.crosstab(df['Segment'],df['Region']).sum().sum()

## pivot_table()?

pd.**pivot_table**(**data**, **values**=None, **index**=None, **columns**=None,<br>
 **aggfunc**='mean',**fill_value**=None, **margins**=False, **dropna**=True,<br>
  **margins_name**='All')

- **data**: The DataFrame to pivot.
- **values**: Column(s) to aggregate.
- **index**: Column(s) to set as index.
- **columns**: Column(s) to pivot.
- **aggfunc**: Function to aggregate the data (e.g., 'mean', 'sum', 'count').
- **fill_value**: Value to replace missing values.
- **margins**: Add all rows/columns.
- **dropna**: Do not include columns whose entries are all NaN.
- **margins_name**: Name of the row/column that will contain the totals when margins is True.

In [ ]:
pd.pivot_table(df,index='Category',columns='Segment', values='Sales', aggfunc='sum')

In [ ]:
pd.pivot_table(df,index='Category',columns='Segment', values='Sales', aggfunc='mean')

In [ ]:
# Show sorted total profit according to sub-category
df.groupby("Sub-Category")['Profit'].sum().sort_values(ascending=False)

## GroupBy vs Pivot table vs Cross table?

**GroupBy**

**Purpose**:
- Used on numerical data!
- Focusing on subsets of data!
- Big data sets

The groupby method is used to split the data into groups based on some criteria, apply a function to each group independently, and then combine the results.

**Use Cases:**

Aggregating data by one or more keys.
Applying custom aggregation functions.
Performing group-wise operations like transformations or filtering.


Example:

In [ ]:
data = {
    'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles'],
    'Sales': [200, 150, 300, 250]
}

df = pd.DataFrame(data)

# Group by 'City' and calculate the sum of 'Sales'
grouped = df.groupby('City')['Sales'].sum()
print(grouped)

**Pivot Table**
**Purpose:**
- Used on numerical data!
- For large datasets
- Summarizing large data

Pivot tables are used to reshape and summarize data. They can aggregate multiple columns and display the results in a tabular format with rows and columns.

**Use Cases:**

Creating summary tables with multiple aggregations.
Handling both numeric and categorical data.
Generating multi-dimensional summaries.

**Example:**

In [ ]:
# Creating a pivot table
pivot_table = pd.pivot_table(df, values='Sales', index='Date', columns='City', aggfunc='sum')
print(pivot_table)

**Cross Table (Crosstab)**

**Purpose:**
- Used on categorical data!
- For Small datasets 
- Analysing relationships and data frequencies in categories

Cross tables, or crosstabs, are used to compute simple cross-tabulations of two (or more) factors. They are especially useful for analyzing categorical data and their frequency distributions.

**Use Cases:**

Counting occurrences of combinations of categories.
Aggregating data with a specific focus on the frequency of categories.
Comparing categorical data across different groups.

**Example:**

In [ ]:
# Create a cross table to count the occurrences of each 'City' on each 'Date'
cross_tab = pd.crosstab(df['Date'], df['City'])
print(cross_tab)

### Choosing Between Pivot table and Cross table?

Use pivot tables when you need interactive and dynamic analysis of data with the ability to explore multiple dimensions and customize reports.
Use cross tables when you need to analyze categorical data, examine relationships, or prepare data for statistical testing.

## How do I select a subset of the dataframe?

> using **.loc()** and **iloc()** is faster than normal pandas

Selecting or filtering specific rows and/or columns? Filtering the data on a condition? Methods for slicing, selecting, and extracting the data you need are available in pandas.
![image.png]()

In [ ]:
titanic = sns.load_dataset("titanic")
titanic.head(1)

In [ ]:
# To select a single column, use square brackets [] with the column name of the column of interest.
ages = titanic["age"]
ages.head()

> To select multiple columns, use a list of column names within the selection brackets [].

In [ ]:
age_sex = titanic[["age", "sex"]]
age_sex

In [ ]:
type(titanic[["age", "sex"]])

In [ ]:
titanic[["age", "sex"]].shape

## How do I filter specific rows from a DataFrame?

> To select rows based on a conditional expression, use a condition inside the selection brackets [].

In [ ]:
titanic["age"] >= 35

In [ ]:
# print whole table where age is more than 35 years
titanic[titanic["age"] >= 35]

In [ ]:
# making changes to df
above_35 =titanic[titanic["age"] >= 35]

## How do I select specific rows and columns from a DataFrame?

In [ ]:
titanic[titanic["age"] > 18][["sex", "pclass", "age"]]

In [ ]:
# column names to list
titanic.columns.tolist()

In [ ]:
# where pclass is 2 or 3 return True
titanic["pclass"].isin([2,3])

In [ ]:
above_35_class_23 = titanic[(titanic["pclass"].isin([2,3])) & (titanic["age"] > 35)]
above_35_class_23.head()

In [ ]:
age_no_na = titanic[titanic["age"].notna()]
age_no_na.head()

## How do I select specific rows and columns from a DataFrame?

In [ ]:
adult_names_cond = titanic.loc[titanic["age"] > 18, [len(x) < 5 for x in titanic.columns.tolist()]]
adult_names_cond.head()

In [ ]:
# BETTER WAY - MORE EFFICIENT
adult_names_list = titanic.loc[titanic["age"] > 18, ["sex", "age", "fare"]]
adult_names_list.head()

## What are the `loc` and `iloc` operators? what are they? why are they?
The loc/iloc operators are required in front of the selection brackets []. When using loc/iloc, the part before the comma is the rows you want, and the part after the comma is the columns you want to select.

**loc** is how we index Series and Dataframes

loc is more frequently used than iloc

In [ ]:
titanic.iloc[10:20, 2:5] # inclusive start : exclusive end

In [ ]:
titanic.iloc[0:3, 3] = "anonymous"
titanic.head()

## Creating new columns derived from existing columns?

![image.png]()

In [ ]:
titanic = sns.load_dataset('Titanic')
titanic.head(2)

In [ ]:
titanic['halfAge'] = titanic['age']*2
titanic

## How can I rename the columns?

In [ ]:
newtitanic = titanic.rename(
    columns={
        'survived':'bachgaye',
        'age':'umar'
    }
)
newtitanic.head()

## How can I aggregate by groups?


![image.png]()

## Concatenate two tables?

## sort Dataframe?

## Joining Tables with common identifier?

### How to create **Bar plot** ?

# Add DataFrames?
# concat dataframes?

# Different Types of Joins in Pandas?

## inner join
![alt](Images/innerJoin.png)

In [ ]:

# Creating dataframe a
a = pd.DataFrame()
 
# Creating Dictionary
d = {'id': [1, 2, 10, 12],
     'val1': ['a', 'b', 'c', 'd']}
 
a = pd.DataFrame(d)
 
# Creating dataframe b
b = pd.DataFrame()
 
# Creating dictionary
d = {'id': [1, 2, 9, 8],
     'val1': ['p', 'q', 'r', 's']}
b = pd.DataFrame(d)
 
# inner join
df = pd.merge(a, b, on='id', how='inner')
 
# display dataframe
df

## Left join
![left join](Images/left-join.png)

In [ ]:
# Creating dataframe a
a = pd.DataFrame()
 
# Creating Dictionary
d = {'id': [1, 2, 10, 12],
     'val1': ['a', 'b', 'c', 'd']}
 
a = pd.DataFrame(d)
 
# Creating dataframe b
b = pd.DataFrame()
 
# Creating dictionary
d = {'id': [1, 2, 9, 8],
     'val1': ['p', 'q', 'r', 's']}
b = pd.DataFrame(d)
 
# left outer join
df = pd.merge(a, b, on='id', how='left')
 
# display dataframe
df

## Right Join
![alt](Images/rightJoin.png)

In [ ]:
# Creating dataframe a
a = pd.DataFrame()
 
# Creating Dictionary
d = {'id': [1, 2, 10, 12],
     'val1': ['a', 'b', 'c', 'd']}
 
a = pd.DataFrame(d)
 
# Creating dataframe b
b = pd.DataFrame()
 
# Creating dictionary
d = {'id': [1, 2, 9, 8],
     'val1': ['p', 'q', 'r', 's']}
b = pd.DataFrame(d)
 
# right outer join
df = pd.merge(a, b, on='id', how='right')
 
# display dataframe
df

## Outer Join
![alt](Images/OutterJoin.png)

In [ ]:
# Creating dataframe a
a = pd.DataFrame()
 
# Creating Dictionary
d = {'id': [1, 2, 10, 12],
     'val1': ['a', 'b', 'c', 'd']}
 
a = pd.DataFrame(d)
 
# Creating dataframe b
b = pd.DataFrame()
 
# Creating dictionary
d = {'id': [1, 2, 9, 8],
     'val1': ['p', 'q', 'r', 's']}
b = pd.DataFrame(d)
 
# full outer join
df = pd.merge(a, b, on='id', how='outer')
 
# display dataframe
df

## Index Join
To merge the Dataframe on indices pass the left_index and right_index arguments as True i.e. both the Dataframes are merged on an index using default Inner Join.

In [ ]:
# Creating dataframe a
a = pd.DataFrame()
 
# Creating Dictionary
d = {'id': [1, 2, 10, 12],
     'val1': ['a', 'b', 'c', 'd']}
 
a = pd.DataFrame(d)
 
# Creating dataframe b
b = pd.DataFrame()
 
# Creating dictionary
d = {'id': [1, 2, 9, 8],
     'val1': ['p', 'q', 'r', 's']}
b = pd.DataFrame(d)
 
# index join
df = pd.merge(a, b, left_index=True, right_index=True)
 
# display dataframe
df

# New batch classes

In [160]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings("ignore")

# Sample Super Store Data

In [161]:
# data 
df =pd.read_excel("Images/SampleSuperstore.xlsx")
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2017-138688,2017-06-12,2017-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,Los Angeles,California,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2016-108966,2016-10-11,2016-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,Fort Lauderdale,Florida,33311.0,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2016-108966,2016-10-11,2016-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,Fort Lauderdale,Florida,33311.0,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [162]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 20 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Row ID         9994 non-null   int64
 1   Order ID       9994 non-null   object
 2   Order Date     9994 non-null   datetime64[ns]
 3   Ship Date      9994 non-null   datetime64[ns]
 4   Ship Mode      9994 non-null   object
 5   Customer ID    9994 non-null   object
 6   Customer Name  9994 non-null   object
 7   Segment        9994 non-null   object
 8   City           9994 non-null   object
 9   State          9994 non-null   object
 10  Postal Code    9983 non-null   float64
 11  Region         9994 non-null   object
 12  Product ID     9994 non-null   object
 13  Category       9994 non-null   object
 14  Sub-Category   9994 non-null   object
 15  Product Name   9994 non-null   object
 16  Sales          9994 non-null   float64
 17  Quantity       9994 non-null   int64
 18  Discount       9994 non-null   float64
 19  Profit         9994 non-null   float64
dtypes: datetime64[ns](2), float64(4), int64(2), object(12)
memory usage: 1.5+ MB

## Searching for particular values in columns ?
searching value in column


Let us assume we have to find all the rows with value 'ABC'

if there will be any such values they will show up below

In [163]:
df[df['Order Date']=='ABC']

Empty DataFrame
Columns: [Row ID, Order ID, Order Date, Ship Date, Ship Mode, Customer ID, Customer Name, Segment, City, State, Postal Code, Region, Product ID, Category, Sub-Category, Product Name, Sales, Quantity, Discount, Profit]
Index: []

let us assume we have to keep only the rows that do not have 'ABC'

**Understand that "~" means !NOT i.e, negetion** 

It will invert the effect of any operation

So the below operation is now choosing all the rows that do not have "ABC" in them.

In [164]:
df[~(df['Order Date']=='ABC')].head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2017-138688,2017-06-12,2017-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,Los Angeles,California,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2016-108966,2016-10-11,2016-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,Fort Lauderdale,Florida,33311.0,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2016-108966,2016-10-11,2016-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,Fort Lauderdale,Florida,33311.0,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

now we add it to the real df

In [165]:
df = df[~(df['Order Date']=='ABC')]

In [ ]:
# Series already in datetime format hence the error
# the code works fine
# df["Order Date"]=pd.to_datetime(df["Order Data"])

## What is the time taken to ship order?

In [167]:
df["Ship Date"]-df["Order Date"]

0      3 days
1      3 days
2      4 days
3      7 days
4      7 days
        ...
9989   2 days
9990   5 days
9991   5 days
9992   5 days
9993   5 days
Length: 9994, dtype: timedelta64[ns]

In [168]:
(df["Ship Date"]-df["Order Date"]).mean()

Timedelta('3 days 23:00:12.247348409')

In [169]:
(df["Ship Date"]-df["Order Date"]).median()

Timedelta('4 days 00:00:00')

Understanding **Ship Mode**

In [170]:
df["Ship Mode"].value_counts()

Ship Mode
Standard Class    5968
Second Class      1945
First Class       1538
Same Day           543
Name: count, dtype: int64

shipping time by **Ship Mode**

In [172]:
df["Shipping Time"] = df["Ship Date"] - df["Order Date"]

In [173]:
df['Shipping Time'].head()

0   3 days
1   3 days
2   4 days
3   7 days
4   7 days
Name: Shipping Time, dtype: timedelta64[ns]

In [178]:
df.groupby("Ship Mode")["Shipping Time"].mean()

Ship Mode
First Class      2 days 04:22:09.518855656
Same Day         0 days 01:03:38.784530386
Second Class     3 days 05:42:47.197943444
Standard Class   5 days 00:10:22.520107238
Name: Shipping Time, dtype: timedelta64[ns]

In [179]:
df.groupby("Ship Mode")["Shipping Time"].median()

Ship Mode
First Class      2 days
Same Day         0 days
Second Class     3 days
Standard Class   5 days
Name: Shipping Time, dtype: timedelta64[ns]

sort **Order ID** by top 5 orders 

Find the top5 highest billilng Order

In [188]:
top5_orders_sales = df.groupby("Order ID")["Sales"].sum().sort_values(ascending=False).head()
top5_orders_sales

Order ID
CA-2015-145317    23661.228
CA-2017-118689    18336.740
CA-2018-140151    14052.480
CA-2018-127180    13716.458
CA-2015-139892    10539.896
Name: Sales, dtype: float64

What are top5 profitable Orders ID making most money?

In [189]:
top5_orders_profit = df.groupby("Order ID")["Profit"].sum().sort_values(ascending=False).head()
top5_orders_profit

Order ID
CA-2017-118689    8762.3891
CA-2018-140151    6734.4720
CA-2018-166709    5039.9856
CA-2017-117121    4946.3700
CA-2015-116904    4668.6935
Name: Profit, dtype: float64

Top 5 Order billings are not the Top 5 most profitable order billings

How much discount was given to 5 high billing Order ID?

finding top5 Order ID below

In [199]:
top5_orders_sales.index

Index(['CA-2015-145317', 'CA-2017-118689', 'CA-2018-140151', 'CA-2018-127180',
       'CA-2015-139892'],
      dtype='object', name='Order ID')

**Order** data of **top 5 profitable Orders ID**

In [203]:
df[df["Order ID"].isin(top5_orders_sales.index)].head(5)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,...,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Shipping Time
164,165,CA-2015-139892,2015-09-08,2015-09-12,Standard Class,BM-11140,Becky Martin,Consumer,San Antonio,Texas,...,Central,OFF-AR-10004441,Office Supplies,Art,BIC Brite Liner Highlighters,9.936,3,0.2,2.7324,4 days
165,166,CA-2015-139892,2015-09-08,2015-09-12,Standard Class,BM-11140,Becky Martin,Consumer,San Antonio,Texas,...,Central,TEC-MA-10000822,Technology,Machines,Lexmark MX611dhe Monochrome Laser Printer,8159.952,8,0.4,-1359.9920,4 days
166,167,CA-2015-139892,2015-09-08,2015-09-12,Standard Class,BM-11140,Becky Martin,Consumer,San Antonio,Texas,...,Central,OFF-ST-10000991,Office Supplies,Storage,Space Solutions HD Industrial Steel Shelving.,275.928,3,0.2,-58.6347,4 days
167,168,CA-2015-139892,2015-09-08,2015-09-12,Standard Class,BM-11140,Becky Martin,Consumer,San Antonio,Texas,...,Central,FUR-CH-10004287,Furniture,Chairs,SAFCO Arco Folding Chair,1740.060,9,0.3,-24.8580,4 days
168,169,CA-2015-139892,2015-09-08,2015-09-12,Standard Class,BM-11140,Becky Martin,Consumer,San Antonio,Texas,...,Central,OFF-AR-10002656,Office Supplies,Art,Sanford Liquid Accent Highlighters,32.064,6,0.2,6.8136,4 days

**Discount** data of **top 5 profitable orders**

In [207]:
df[df["Order ID"].isin(top5_orders_sales.index)]["Discount"]

164     0.2
165     0.4
166     0.2
167     0.3
168     0.2
169     0.8
170     0.2
2623    0.2
2624    0.0
2625    0.0
2626    0.0
2696    0.5
2697    0.5
2698    0.2
2699    0.2
2700    0.2
2701    0.2
2702    0.2
6825    0.0
6826    0.0
6827    0.0
6828    0.0
6829    0.0
8151    0.0
8152    0.0
8153    0.0
Name: Discount, dtype: float64

We find data on discount given to top 5 Profitable Order ID

In [209]:
df[df["Order ID"].isin(top5_orders_sales.index)].groupby("Order ID")["Discount"].mean()*100

Order ID
CA-2015-139892    32.857143
CA-2015-145317    28.571429
CA-2017-118689     0.000000
CA-2018-127180     5.000000
CA-2018-140151     0.000000
Name: Discount, dtype: float64

Finding more insight about Ship Mode
comparing sales profit and quantity from the perspective of Ship Mode

In [215]:
# using round() as 
np.round(df.groupby("Ship Mode")[["Sales",'Profit','Quantity']].sum(), decimals=2)

                     Sales     Profit  Quantity
Ship Mode
First Class      351428.42   48969.84      5693
Same Day         128363.12   15891.76      1960
Second Class     459193.57   57446.64      7423
Standard Class  1358215.74  164088.79     22797

In [217]:
df.drop("Ship Mode", axis=1).head()

,Row ID,Order ID,Order Date,Ship Date,Customer ID,Customer Name,Segment,City,State,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Shipping Time
0,1,CA-2017-152156,2017-11-08,2017-11-11,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136,3 days
1,2,CA-2017-152156,2017-11-08,2017-11-11,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820,3 days
2,3,CA-2017-138688,2017-06-12,2017-06-16,DV-13045,Darrin Van Huff,Corporate,Los Angeles,California,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714,4 days
3,4,US-2016-108966,2016-10-11,2016-10-18,SO-20335,Sean O'Donnell,Consumer,Fort Lauderdale,Florida,33311.0,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310,7 days
4,5,US-2016-108966,2016-10-11,2016-10-18,SO-20335,Sean O'Donnell,Consumer,Fort Lauderdale,Florida,33311.0,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164,7 days

In [218]:
df['Product Name']

0                       Bush Somerset Collection Bookcase
1       Hon Deluxe Fabric Upholstered Stacking Chairs,...
2       Self-Adhesive Address Labels for Typewriters b...
3           Bretford CR4500 Series Slim Rectangular Table
4                          Eldon Fold 'N Roll Cart System
                              ...
9989                               Ultra Door Pull Handle
9990    Tenex B1-RE Series Chair Mats for Low Pile Car...
9991                                Aastra 57i VoIP phone
9992    It's Hot Message Books with Stickers, 2 3/4" x 5"
9993    Acco 7-Outlet Masterpiece Power Center, Wihtou...
Name: Product Name, Length: 9994, dtype: object

In [219]:
df['Customer ID']

0       CG-12520
1       CG-12520
2       DV-13045
3       SO-20335
4       SO-20335
          ...
9989    TB-21400
9990    DB-13060
9991    DB-13060
9992    DB-13060
9993    CC-12220
Name: Customer ID, Length: 9994, dtype: object

data about a particular customer ID

In [225]:
df[df['Customer ID']=='CG-12520']

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,...,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Shipping Time
0,1,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,...,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.960,2,0.0,41.9136,3 days
1,2,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,Henderson,Kentucky,...,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.940,3,0.0,219.5820,3 days
5491,5492,CA-2018-164098,2018-01-26,2018-01-27,First Class,CG-12520,Claire Gute,Consumer,Houston,Texas,...,Central,OFF-ST-10000615,Office Supplies,Storage,"SimpliFile Personal File, Black Granite, 15w x...",18.160,2,0.2,1.8160,1 days
6877,6878,US-2016-123918,2016-10-15,2016-10-15,Same Day,CG-12520,Claire Gute,Consumer,Dallas,Texas,...,Central,FUR-FU-10004952,Furniture,Furnishings,C-Line Cubicle Keepers Polyproplyene Holder w/...,131.376,6,0.6,-95.2476,0 days
6878,6879,US-2016-123918,2016-10-15,2016-10-15,Same Day,CG-12520,Claire Gute,Consumer,Dallas,Texas,...,Central,OFF-PA-10003001,Office Supplies,Paper,Xerox 1986,5.344,1,0.2,1.8704,0 days

In [226]:
df['Customer ID']=="CG-12520"

0        True
1        True
2       False
3       False
4       False
        ...
9989    False
9990    False
9991    False
9992    False
9993    False
Name: Customer ID, Length: 9994, dtype: bool

df.drop